package com.bj.common;


/**
 * @author : lirui
 * @time : 2016/10/22 0022 15:00
 * @desc : 错误码
 * 1打头：无法判断类别的错误信息，无明显含义
 * 2打头：参数判断
 * 3打头：数据库错误
 * 4打头：结果分析
 * 5打头：外部调用错误信息
 * 6打头：业务信息（该消息注意使用敬语）
 */
public enum ErrCode {
    /** 成功 */
    _0(0, "成功"),

    /** 系统异常 */
    _1001(1001, "系统异常"),

    /** 自定义异常信息 */
    _1002(1002, "{}"),

    /** 参数为空 */
    _2000(2000, "参数为空"),

    /** 参数[{}]必填 */
    _2001(2001, "参数[{}]必填"),

    /** 参数[{}]格式[{}] */
    _2002(2002, "参数[{}]格式[{}]"),

    /** 参数[{}]范围[{},{}] */
    _2003(2003, "参数[{}]范围[{},{}]"),

    /** 参数[{}]长度小于[] */
    _2004(2004, "参数[{}]长度小于[]"),

    /** 参数[{}]长度大于[] */
    _2005(2005, "参数[{}]长度大于[]"),

    /** 参数[{}]长度范围[{},{}] */
    _2006(2006, "参数[{}]长度范围[{},{}]"),

    /** 参数[{}]长度为[{}] */
    _2007(2007, "参数[{}]长度为[{}]"),

    /** 参数[{}]可选项[{}] */
    _2008(2008, "参数[{}]可选项[{}]"),

    /** 参数[{}]中必填一项 */
    _2009(2009, "参数[{}]中必填一项"),

    /** 参数[{}]大于[{}] */
    _2010(2010, "参数[{}]大于[{}]"),

    /** 参数[{}]小于等于[{}] */
    _2011(2011, "参数[{}]小于等于[{}]"),

    /** 参数[{}]大于[{}]而小于等于[{}] */
    _2012(2012, "参数[{}]大于[{}]而小于等于[{}]"),

    /** 参数{}可选项:{} */
    _2013(2012, "参数{}可选项:{}"),

    /** 参数{}含有小数:{} */
    _2014(2014, "参数{}含有小数:{}"),

    /** 参数[{}]小于等于[{}] */
    _2015(2011, "参数[{}]小于[{}]"),
    
    _2016(2016, "校验失败"),

    /** 数据库更新失败 */
    _3000(3000,"更新失败"),

    /** 数据库更新{}失败 */
    _3001(3001,"更新{}失败"),

    /** 数据库唯一索引重复 */
    _3002(3002,"{}重复"),

    /** 数据库更新{}失败 */
    _3003(3003,"更新【{}】失败,失败信息:{}"),

    /** 数据库插入更新失败 */
    _3004(3004,"插入失败"),

    /** 未查到相关信息 */
    _4001(4001, "未查到相关信息"),

    /** 根据[{}]未查到相关信息 */
    _4002(4002, "根据[{}]未查到相关信息"),


    /** 不存在的[{}] */
    _4003(4003, "不存在的[{}]"),
    /** {}已存在 */
    _4004(4004, "{}已存在"),

    /** {}已存在 */
    _4005(4005, "更换的手机号{}不能为紧急联系人"),

    /** {}验证码发送失败 */
    _4006(4006, "给手机号{}发送短信验证码失败"),

    /** {}验证码错误*/
    _4007(4007, "手机号{}的验证码错误"),

    /** {}72小时之内已经修改成功*/
    _4008(4008, "手机号{}已经修改成功"),

    _4009(4009, "修改手机号{}发送验证码次数已达上限"),

    _4010(4010, "手机号{}的用户今日已经操作过修改手机号。"),

    _4011(4011, "注册app类型不能为空"),

    _4012(4012,"保存用户关联关系失败"),

    /** 外部系统异常 */
    _5000(5000, "外部系统异常"),

    /** ucent业务异常 */
    _5001(5001, "ucent系统异常"),

    /** 手机号已在其他系统注册借款人 */
    _5002(5002, "手机号已在其他系统注册借款人"),

    /** 用户名或密码不正确 */
    _5003(5003, "用户名或密码不正确"),

    /** 旧密码不正确 */
    _5004(5004, "旧密码不正确"),

    /** 用户未注册 */
    _5005(5005, "用户未注册"),

    /** ucenter未知错误 */
    _5006(5006, "ucenter未知错误"),

    /** bankgate未知错误 */
    _5007(5007, "bankgate未知错误"),

    /** 查询用户默认银行卡失败 */
    _5008(5008, "查询用户默认银行卡失败"),

    /** tradecore未知错误 */
    _5009(5009, "tradecore未知错误"),

    /** 查询袋鼠的标的还款列表失败 */
    _5010(5010, "查询袋鼠的标的还款列表失败"),

    /** 代扣回调信息不正确 */
    _5011(5011, "代扣回调信息不正确"),

    /** 未查询到默认银行卡 */
    _5012(5012, "未查询到默认银行卡"),

    /** 加速审核接口调用失败 **/
    _5013(5013, "加速审核接口调用失败"),

    /** 微贷网银充值链接获取失败 **/
    _5014(5014, "微贷网银充值链接获取失败"),

    /**授权查询预授信失败 **/
    _5015(5015, "授权查询预授信失败"),

    /**查询车贷借款记录失败*/
    _5016(5015,"查询车贷借款记录失败"),

    /**查询微易融借款记录失败*/
    _5017(5017,"查询微易融借款记录失败"),

    /**账号被冻结，登录失败*/
    _5020(5020,"用户账号被冻结，如需解冻请联系客服"),
    
    _5021(5021,"请使用原设备登录云闪贷App"),
    _5022(5022,"获取机构资金开户链接中"),

    /** 业务异常 */
    _6000(6000,"业务异常"),

    /** 您{已/未}完成实名认证 */
    _6001(6001,"您{}完成实名认证"),

    /** 您{已/未}完成银行卡绑定 */
    _6002(6002,"您{}完成银行卡绑定"),

    /** 您已申请过额度 */
    _6003(6003,"您已申请过额度"),

    /** 您的可用额度不足 */
    _6004(6004,"您的可用额度不足"),

    /** 仅支持储蓄卡 */
    _6005(6005,"仅支持储蓄卡"),

    /** 您已有一笔借款正在处理中 */
    _6006(6006,"您已有一笔借款正在处理中，暂不支持提交新的借款申请"),

    /** 您有逾期借款未还清 */
    _6007(6007,"您有逾期借款未还清，暂不支持提交新的借款申请"),

    /** 当前额度已经失效，暂无法申请 */
    _6008(6008,"当前额度已经失效，暂无法申请"),

    /** 查询{}失败，请稍后重试或联系客服 */
    _6009(6009,"查询{}失败，请稍后重试或联系客服"),

    /** 银行卡信息错误，请联系客服线下解绑 */
    _6010(6010,"银行卡信息错误，请联系客服线下解绑"),

    /** 您已完成存管银行卡绑定 */
    _6011(6011,"您已开通存管账户"),

    /** 您有待还借款未还清 */
    _6012(6012,"您有待还借款未还清，暂不支持提交新的借款申请"),

    _6013(6013,"您已有一笔借款正在放款中，暂不支持提交新的借款申请"),

    _6014(6014,"续贷代扣失败"),

    _6015(6015,"目前仅支持随想贷申请续贷，其他产品暂不支持，非常抱歉！"),

    _6016(6016,"续贷还款金额超限"),

    _6017(6017,"无续贷白名单，不可续贷"),

    _6018(6018,"续贷处理中，请稍后查看续贷结果"),

    _6019(6019,"续贷支付金额有误，请重新申请"),

    _6020(6020,"芝麻信用未授权或已过期，请返回首页重试"),

    _6021(6021,"续贷处理中"),

    /** 有订单正在处理中 */
    _6022(6022,"有订单正在处理中"),

    /** 有订单已还款 */
    _6023(6023, "有订单已还款"),


    _6024(6024, "未查到可还款的还款计划"),

    _6025(6025,"你已申请过续贷，请勿重复申请！"),

    _6026(6026,"距离还款日期超过一个月，暂不支持单笔提前还款"),


    _6027(6027,"支付次数已达上限"),
    _6028(6028,"还款计划生成失败"),
    _6029(6029, "还款计划的已还金额和还款流水的扣款金额对应不上"),
    _6030(6030, "代扣异常"),
    _6031(6031, "{}"), //代扣失败
    _6032(6032, "车贷存在未结清订单"),
    /** 您有未结清的微易融 */
    _6033(6033, "您有未结清的微易融"),
    _6034(6034, "规则校验借款审核拒绝"),
    _6035(6035, "您是随想贷用户，暂不支持该产品"),
    _6036(6036, "请先结清之前的还款计划"),
    _6037(6037, "借款年利率超出国家限制值"),
    _6038(6038, "仅支持单期结清或者全部提前还款，请重新选择还款计划"),
    _6039(6039, "您有一笔车抵贷的提额申请已在处理中"),
    /** 注册问题，6040-6049 */
    _6040(6040, "用户数据异常，请联系客服处理"),
    _6041(6041, "邮箱校验错误"),


    // 6101-6199为用户信息相关响应码 >>>>>>>>>>>>>>>>>>>>>>>

    _6101(6101, "用户未在白名单，请联系客服处理"),
    // 6101-6199为用户信息相关响应码 <<<<<<<<<<<<<<<<<<<<<<<

    // 6201-6299为代扣、还款响应码 >>>>>>>>>>>>>>>>>>>>>>>

    /** 该用户存在一笔处理中的代扣流水，请稍后重试 */
    _6201(6201, "该用户存在一笔处理中的代扣流水，请稍后再试"),
    _6202(6202, "不能跳期还款"),
    _6203(6203, "请先结清逾期还款计划"),
    _6204(6204, "金额不能小于0"),
    _6205(6205, "充值金额不能小于50"),
    _6206(6206, "您的上一笔随想贷尚未结清，请等待续贷处理完成后再尝试操作"),
    _6207(6207, "账户余额不足"),
    _6208(6208, "有一笔订单在处理中，请不要重复还款"),
    _6209(6209, "存在订单已经还款，请不要重复还款"),
    _6210(6210, "请先结清之前的还款计划"),
    _6211(6211, "未查到用户对应还款计划"),
    _6212(6212, "月还息到期还本，未获取到2条还款"),
    _6213(6213, "月还息到期还本，未获取到-1期"),
    _6214(6214, "距离还款日期超过一个月，暂不支持单笔提前还款"),
    _6215(6215, "仅支持单期结清或者全部提前还款，请重新选择还款计划"),
    _6216(6216, "此账单暂不支持提前还款，如需结清请联系客服"),
    _6217(6217, "您的上一笔随想贷尚未结清，请等待续贷处理完成后再尝试操作"),
    _6218(6218, "代扣金额不符"),
    _6219(6219, "无法提前还款，请联系客服"),
    _6220(6220, "还款请求正在处理中，不可重复还款"),
    _6221(6221, "多标不可提前还款，请联系客服处理"),
    _6222(6222, "请求正在处理中，请稍后再试"),
    _6223(6223, "支付异常"),
    _6224(6224,"还款金抵扣失败"),
    _6225(6225,"查询账务系获取垫资相关信息异常"),
    _6226(6226,"订单号数据异常"),
    _6227(6227,"账务系统调用异常"),
    _6228(6228,"查询账务系统还款计划异常"),
    _6229(6229,"提前还款拒绝"),
    _6230(6230,"账务还款流水查询异常"),
    _6231(6231,"还款处理中"),
    _6232(6232,"暂不支持一键还款，请前往订单详情中操作"),
    _6233(6233,"该订单暂不支持逾期和当前期同时还款，请先结清逾期还款"),
    _6234(6234,"该订单暂不支持多笔同时还款，请单笔还款"),
    _6235(6235,"还款处理中，请稍后查看还款结果"),

    // 6201-6299为代扣响应码 <<<<<<<<<<<<<<<<<<<<<<<

    // 6300为渠道响应码 <<<<<<<<<<<<<<<<<<<<<<<
    _6300(6300,"未查询到当前渠道信息，不支持注册"),



    /** fastdfs文件上传失败 */
    _7001(7001, "文件上传失败"),
    _7002(7002, "文件上传次数超限制，无法上传"),

    _7003(7003, "不用使用优惠券，借款金额未达到{}"),
    _7004(7004, "用户已经领取过此类优惠券"),
    _7005(7005,"使用优惠券时异常"),
    _7011(7011,"无法使用还款金，还款门槛未达到"),
    _7012(7012,"还款金未启用"),
    _7014(7014,"无法使用还款金，借款门槛未达到"),
    _7015(7015,"无法使用还款金，使用时间不再有效期内"),
    _7016(7016,"无法使用还款金劵，借款金额未达到{}"),

    _8001(8001,"贷款记录数据异常"),
    _8002(8002,"用户税率异常"),
    _8003(8003,"垫资失败"),
    _8004(8004,"用户不符合续贷要求"),
    _8005(8005,"该贷款不是还款中或逾期状态，不能续贷"),
    _8006(8006,"合同不可用，续贷失败"),
    _7006(7006,"还未配置活动券"),
    _7007(7007,"错误的邀请码"),
    _7008(7008,"已经领取过此类优惠券"),
    _7009(7009,"活动{}未配置优惠券，类型{}"),
    _7010(7010,"生成二维码失败"),
    _8007(8007,"手机号和微贷借款不一致"),
    _8008(8008,"不满足领劵条件"),

    // 8100-8150为申请借款错误码 <<<<<<<<<<<<<<<<<<<<<<<
    _8100(8100,"计算运营管理费失败"),
    _8101(8101,"计算保险费失败"),
    _8102(8102,"计算综合管理费失败"),
    _8103(8103,"查询多米贷借款记录失败"),
    _8104(8104,"多米贷存在未结清订单"),
    _8105(8105,"多米贷存在审核中订单"),
    _8106(8106,"您已有借款申请正在处理中，暂不支持提交新的借款申请"),
    _8107(8105,"多小米存在审核中订单"),

    _8200(8200,"您申请的额度正在生成中，请耐心等待"),
    _8201(8201,"您已提交额度申请，请耐心等待"),
    _8202(8202,"您的额度申请失败，请重新申请额度"),

    // 9字头 为合同错误码 <<<<<<<<<<<<<<<<<<<<<<<
    _9000(9000,"获取签约链接失败[订单号不能为空]"),
    _9001(9001,"获取签约链接失败[未查询到用户信息]"),
    _9002(9002,"获取签约链接失败[Error]"),
    _9003(9003,"用户认证失败"),
    _9004(9004,"真融宝合同上传正在处理"),
    _9005(9005,"正在生成签约链接"),
    
    // 10字头 新版借款错误码
    _10000(10000,"创建订单[暂不支持的产品类型]"),
    _10001(10001,"创建订单[不支持的用户类型]"),

    // 11字头 外部渠道错误码
    _11000(11000,"未查询到授信信息"),
    _11001(11001,"未查询到借款记录"),
    _11002(11002,"未获取到微贷和渠道关联用户信息"),

    ;

    /** 错误码 */
    private Integer code;

    /**  */
    private String desc;

    ErrCode(Integer code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public Integer getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

    public String getDesc(Integer code) {
        if (null == code) {
            return null;
        }
        for (ErrCode e : ErrCode.values()) {
            if (e.getCode().equals(code)) {
                return e.getDesc();
            }
        }
        return null;
    }

}
